# Módulo 01. Tasca 01. Bases datos relacionales SQL
## By José Manuel Castaño

## - Exercici 1

A partir dels documents adjunts (estructura i dades), crea una base de dades amb MySQL. Mostra les característiques principals de l'esquema creat i explica les diferents taules i variables que hi ha.

Para realizar los ejercicios utilizaremos 2 librerías: mysql.connector y sqlalchemy. Ambas son ORM (Object Relational Mapper) que permiten acceder y facilitar el trabajo con SQL. Además, sqlalchemy permite pasar a dataframes de forma sencilla

In [1]:
import pandas as pd
import mysql.connector
import sqlalchemy

In [14]:
#Inicializamos el conector mysql.connector
mydb = mysql.connector.connect(
  host="localhost",
  user="root",
)
#Probamos el conector
mycursor = mydb.cursor()
mycursor.execute("SHOW DATABASES")
for x in mycursor:
    print(x)

('cursmysql',)
('information_schema',)
('mi_empresa',)
('mi_escuela',)
('mi_nueva_empresa',)
('movies',)
('movies_ini',)
('mysql',)
('performance_schema',)
('phpmyadmin',)
('test',)

Utilizaremos la librería sqlalchemy. Se trata de un ORM (Object Relational Mapper) que permite acceder y facilitar el trabajo con SQL. Igualmente permite pasar a dataframes de forma sencilla

In [15]:
#Inicializamos y probamos el conector sqlalchemy
engine = sqlalchemy.create_engine('mysql+mysqlconnector://root:@localhost/movies')
movie_df = pd.read_sql_table("tb_movie", engine)

movie_df.head()

,movie_id,movie_title,movie_date,movie_format,movie_genre_id,created_by_user,created_date,updated_date
0,1,Apocalypse Now,1979-05-10,Film,11,OS_SGAD,NaT,NaT
1,2,Star Wars:Episode IV - A New Hope,1977-05-25,Film,2,OS_SGAD,NaT,NaT
2,3,Indiana Jones and the Temple of Doom,1984-05-08,Film,1,OS_SGAD,NaT,NaT
3,4,The Terminal,2004-06-18,Digital,3,OS_SGAD,NaT,NaT
4,5,Jaws,1975-01-01,Film,10,OS_SGAD,NaT,NaT

### Esquema y explicación general de la base de datos movies

## - Exercici 2

Realitza la següent consulta sobre la base de dades acabada de crear: 

Has d'obtenir el nom, el país i la data de naixement d'aquelles persones per les quals no consti una data de mort i ordenar les dades de la persona més vella a la persona més jove.

In [7]:
query2= '''SELECT person_name, person_country, person_dob, person_dod
FROM tb_person
WHERE person_dod is null
ORDER BY person_dob;'''

personas_vivas= pd.read_sql_query(query2, engine)
personas_vivas

               person_name person_country  person_dob person_dod
0            John Williams  United States  1928-08-08       None
1               Vera Miles  United States  1929-08-23       None
2             Sean Connery       Scotland  1930-07-08       None
3            Robert Duvall  United States  1931-01-05       None
4           Morgan Freeman  United States  1935-10-01       None
5     Francis Ford Coppola  United States  1939-04-07       None
6               Gary Kurtz  United States  1940-07-27       None
7             Martin Sheen  United States  1940-08-03       None
8            Harrison Ford  United States  1942-07-13       None
9             George Lucas  United States  1944-05-14       None
10         Carmine Coppola  United States  1945-07-08       None
11        Steven Spielberg  United States  1946-12-18       None
12             Tim Robbins  United States  1949-06-07       None
13              Mel Gibson      Australia  1950-08-09       None
14               Tom Hanks  United States  1956-07-09       None
15  Emilio Martinez Lazaro          Spain  1956-09-09       None
16          Karra Elejalde          Spain  1960-03-06       None
17          Emilio Estevez  United States  1962-05-12       None
18           Ramón Estevez  United States  1963-08-07       None
19            Carmen Machi          Spain  1964-08-09       None
20           Charlie Sheen  United States  1965-09-03       None
21           Reneé Estevez  United States  1967-04-02       None
22    Catherine Zeta-Jones          Wales  1969-09-25       None
23            Robert Alamo          Spain  1970-05-06       None
24  Daniel Sanchez Arevalo          Spain  1970-06-08       None
25          Quim Gutierrez          Spain  1981-03-27       None
26        Veronica Echegui          Spain  1983-03-14       None
27     Taylor Levi Estevez  United States  1984-06-22       None
28             Dani Rovira          Spain  1984-07-01       None
29      Paula Speert Sheen  United States  1986-01-06       None
30      Paloma Rae Estevez  United States  1986-02-15       None
31              Clara Lago          Spain  1986-04-17       None
32          Patrick Criado          Spain  1995-09-23       None
33       Paula Jones-Sheen  United States  2003-07-06       None
34               Sam Sheen  United States  2004-03-09       None
35              Lola Sheen  United States  2005-06-01       None
36               Bob Sheen  United States  2009-05-01       None
37               Max Sheen  United States  2009-05-01       None

## - Exercici 3

Realitza la següent consulta sobre la base de dades acabada de crear: 

Has d'obtenir el nom del gènere i el nombre total de pel·lícules d'aquest gènere i ordenar-ho per ordre descendent de nombre total de pel·lícules.

In [8]:
query3='''
SELECT genre_name, COUNT(movie_id) AS num_movies
FROM tb_genre 
LEFT JOIN tb_movie
ON tb_movie.movie_genre_id = tb_genre.genre_id
GROUP BY genre_name
ORDER BY num_movies DESC '''

movies_genre= pd.read_sql_query(query3, engine)
movies_genre

         genre_name  num_movies
0           Comedia           3
1          Suspense           2
2   Ciencia Ficción           2
3           Romance           2
4            Acción           2
5             Drama           2
6          Fantasía           1
7            Bélico           1
8            Terror           1
9         Melodrama           0
10       Documental           0
11          Musical           0

## - Exercici 4

Realitza la següent consulta sobre la base de dades acabada de crear: 

Has d'obtenir, per a cada persona, el seu nom i el nombre màxim de rols diferents que ha tingut en una mateixa pel·lícula. 

Posteriorment, mostra únicament aquelles persones que hagin assumit més d'un rol en una mateixa pel·lícula.

Para la primera parte del ejercicio realizaremos una subquery donde contamos el número de roles por nombre y movie. Posteriormente agrupamos por nombre obteniendo el número máximo de roles

In [10]:
query4='''
SELECT person_name, MAX(roles) as max_roles
FROM
    (SELECT person_name, movie_id, COUNT(role_id) AS roles
    FROM tb_person
    LEFT JOIN tb_movie_person
    ON tb_person.person_id = tb_movie_person.person_id
    GROUP BY person_name, movie_id) as tabla1
GROUP BY person_name
'''
max_rols= pd.read_sql_query(query4, engine)
max_rols

                person_name  max_roles
0   Alfred Joseph Hitchcock          3
1           Anthony Perkins          1
2                 Bob Sheen          0
3              Carmen Machi          1
4           Carmine Coppola          1
5      Catherine Zeta-Jones          1
6             Charlie Sheen          1
7                Clara Lago          1
8               Dani Rovira          1
9    Daniel Sanchez Arevalo          2
10           Emilio Estevez          0
11   Emilio Martinez Lazaro          1
12     Francis Ford Coppola          3
13               Gary Kurtz          1
14             George Lucas          2
15            Harrison Ford          1
16            Hector Colome          1
17            John Williams          1
18           Karra Elejalde          1
19               Lola Sheen          0
20            Marlon Brando          1
21             Martin Sheen          1
22                Max Sheen          0
23               Mel Gibson          2
24           Morgan Freeman          1
25       Paloma Rae Estevez          0
26           Patrick Criado          1
27        Paula Jones-Sheen          0
28       Paula Speert Sheen          0
29           Quim Gutierrez          1
30            Ramón Estevez          0
31            Reneé Estevez          0
32             Robert Alamo          1
33            Robert Duvall          1
34                Sam Sheen          0
35             Sean Connery          0
36         Steven Spielberg          2
37      Taylor Levi Estevez          0
38              Tim Robbins          1
39                Tom Hanks          1
40               Vera Miles          1
41         Veronica Echegui          1

Filtramos la anterior consulta mediante Having para obtener las personas que han tenido más de un rol en una misma movie

In [11]:
query4b='''
SELECT person_name, MAX(roles) as max_roles
FROM
    (SELECT person_name, movie_id, COUNT(role_id) AS roles
    FROM tb_person
    LEFT JOIN tb_movie_person
    ON tb_person.person_id = tb_movie_person.person_id
    GROUP BY person_name, movie_id) as tabla1
GROUP BY person_name
HAVING max_roles>1
'''
roles_mayor1= pd.read_sql_query(query4b, engine)
roles_mayor1

               person_name  max_roles
0  Alfred Joseph Hitchcock          3
1   Daniel Sanchez Arevalo          2
2     Francis Ford Coppola          3
3             George Lucas          2
4               Mel Gibson          2
5         Steven Spielberg          2

## - Exercici 5

Realitza la següent operació sobre la base de dades acabada de crear: 

Has de crear un nou gènere anomenat "Documental" el qual tingui com a identificador el nombre 69.

In [16]:
insertar='''
INSERT INTO movies.tb_genre (genre_id, genre_name, created_by_user, created_date, updated_date)
VALUES (%s, %s, %s, %s, %s)
'''
mycursor.execute(insertar, ('69', 'Documental', 'OS_SGAD', '2022-07-19', '2022-07-19'))
mydb.commit()

In [17]:
genres= pd.read_sql_table("tb_genre", engine)
genres

    genre_id       genre_name created_by_user created_date updated_date
0          1           Acción         OS_SGAD          NaT          NaT
1          2  Ciencia Ficción         OS_SGAD          NaT          NaT
2          3          Comedia         OS_SGAD          NaT          NaT
3          4            Drama         OS_SGAD          NaT          NaT
4          5         Fantasía         apermag          NaT          NaT
5          6        Melodrama         apermag   2018-09-01   2018-09-27
6          7          Musical         OS_SGAD          NaT          NaT
7          8          Romance         OS_SGAD          NaT          NaT
8          9         Suspense         OS_SGAD          NaT          NaT
9         10           Terror         OS_SGAD          NaT          NaT
10        11           Bélico         OS_SGAD          NaT          NaT
11        69       Documental         OS_SGAD   2022-07-19   2022-07-19

## - Exercici 6

Fes la següent operació sobre la base de dades acabada de crear:  

Elimina la pel·lícula "La Gran Familia Española" de la base de dades.

Para eliminar una película de la tabla tb_movie es necesario previamente eliminar todos los registros que apuntan a dicha película de la tabla tb_movie_person ya que el campo movie_id es clave primaria de tb_movie_person

In [19]:
#Eliminamos movie_id=11 de la tabla movie_person
eliminar = '''
DELETE 
FROM movies.tb_movie_person
WHERE movie_id = 11;
'''
mycursor.execute(eliminar)
mydb.commit()


#Eliminamos movie_id=11 de la tabla movie
eliminar = '''
DELETE 
FROM movies.tb_movie
WHERE movie_id = 11;
'''
mycursor.execute(eliminar)
mydb.commit()

## - Exercici 7

Realitza la següent operació sobre la base de dades acabada de crear: 

Canvia el gènere de la pel·lícula "Ocho apellidos catalanes" perquè consti com a comèdia i no com a romàntica.

In [21]:
cambio='''
UPDATE  movies.tb_movie 
SET movie_genre_id= 3
WHERE movie_id= 9
'''
mycursor.execute(cambio)
mydb.commit()

Hacemos una query para comprobar que se ha realizado el cambio

In [23]:
query7='''
SELECT movie_title, movie_genre_id, genre_name
FROM tb_movie
LEFT JOIN tb_genre
ON tb_movie.movie_genre_id= tb_genre.genre_id
'''
pelis= pd.read_sql_query(query7, engine)
pelis

                             movie_title  movie_genre_id       genre_name
0                         Apocalypse Now              11           Bélico
1      Star Wars:Episode IV - A New Hope               2  Ciencia Ficción
2   Indiana Jones and the Temple of Doom               1           Acción
3                           The Terminal               3          Comedia
4                                   Jaws              10           Terror
5                ET The Extraterrestrial               5         Fantasía
6                                 Psycho               9         Suspense
7                  Ocho Apellidos Vascos               3          Comedia
8               Ocho Apellidos Catalanes               3          Comedia
9                El otro lado de la cama               8          Romance
10                   El dia de la bestia               1           Acción
11                            Braveheart               4            Drama
12              The Shawshank Redemption               4            Drama
13            Las brujas de Zugarramurdi               9         Suspense
14                          Blade Runner               2  Ciencia Ficción